### Terraform Plan
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_repository.citest will be created
  + resource "aws_ecr_repository" "citest" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "selvoc-dev-citest"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Project"     = "selvoc"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Project"     = "selvoc"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
